[
  {
    "score": 0.16543348133563995,
    "title": "Google’s Whisk AI generator will ‘remix’ the pictures you plug in",
    "id": "https://www.theverge.com/2024/12/16/24322614/google-whisk-ai-generator-remix-pictures-plug-in",
    "url": "https://www.theverge.com/2024/12/16/24322614/google-whisk-ai-generator-remix-pictures-plug-in",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "Google has announced a new AI tool called Whisk that lets you generate images using other images as prompts instead of requiring a long text prompt. With Whisk, you can offer images to suggest what you’d like as the subject, the scene, and the style of your AI-generated image, and you can prompt Whisk with multiple images for each of those three things. (If you want, you can fill in text prompts, too.) If you don’t have images on hand, you can click a dice icon to have Google fill in some images for the prompts (though those images also appear to be AI-generated). You can also enter some text into a text box at the end of the process if you want to add extra detail about the image you’re looking for, but it’s not required. Whisk will then generate images and a text prompt for each image. You can favorite or download the image if you’re happy with the results, or you can refine an image by entering more text into the text box or clicking the image and editing the text prompt. A screenshot of Whisk. I clicked the dice to generate a subject, scene, and style. I swapped out the auto-generated scene by entering a text prompt. Whisk created the first two images, which I iterated on by asking Whisk to add some steam around the subject (because it’s a fire being in water), resulting in the next two images. Screenshot by Jay Peters / The Verge In a blog post , Google stresses that Whisk is designed to be for “rapid visual exploration, not pixel-perfect edits.” The company also says that Whisk may “miss the mark,” which is why it lets you edit the underlying prompts. In the few minutes I’ve used the tool while writing this story, it’s been entertaining to tinker with. Images take a few seconds to generate, which is annoying, and while the images have been a little strange, everything I’ve generated has been fun to iterate on. Google says Whisk uses the “latest” iteration of its Imagen 3 image generation model, which it announced today . Google also introduced Veo 2 , the next version of its video generation model, which the company says has an understanding of “the unique language of cinematography” and hallucinates things like extra fingers “less frequently” than other models (one of those other models is probably OpenAI’s Sora ). Veo 2 is coming first to Google’s VideoFX, which you can get on the Google Labs waitlist for, and it will be expanded to YouTube Shorts “other products” sometime next year.",
    "summary": "Google released two AI updates today: Whisk, an image generator that uses images as prompts instead of text, and Veo 2, an improved video generation model for Google VideoFX, coming to YouTube Shorts next year.  Whisk uses Google's Imagen 3 model and allows iterative refinement of generated images.\n",
    "image": "https://cdn.vox-cdn.com/thumbor/27GikmT3l83HxnHHUzkV3iDr1ME=/0x0:1752x1167/1200x628/filters:focal(876x584:877x585)/cdn.vox-cdn.com/uploads/chorus_asset/file/25792808/ai_label_3.png",
    "favicon": "https://www.theverge.com/icons/favicon_32x32.png"
  },
  {
    "score": 0.15929453074932098,
    "title": "Meta updates its smart glasses with real-time AI video",
    "id": "https://techcrunch.com/2024/12/16/meta-updates-its-smart-glasses-with-real-time-ai-video/",
    "url": "https://techcrunch.com/2024/12/16/meta-updates-its-smart-glasses-with-real-time-ai-video/",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "Kyle Wiggers",
    "text": "Meta’s Ray-Ban Meta smart glasses are getting several new AI-powered upgrades , including the ability to have an ongoing conversation and translate between languages. Ray-Ban Meta owners in Meta’s early access program for the U.S. and Canada can now download firmware v11, which adds “live AI.” First unveiled this fall, live AI lets wearers continuously converse with Meta’s AI assistant, Meta AI, to reference things they discussed earlier in the conversation. Without having to say the “Hey Meta” wakeword, wearers can interrupt Meta AI to ask follow-up questions or change the topic. Live AI also works with real-time video. Wearers can ask questions about what they’re seeing in real time — for example, what’s around their neighborhood. Real-time AI video for Ray-Ban Meta was a significant focus of Meta’s Connect dev conference early this fall. Positioned as an answer to OpenAI’s Advanced Voice Mode with Vision and Google’s Project Astra , the tech allows Meta’s AI to answer questions about what’s in view of the glasses’ front-facing camera. With Monday’s update, Meta becomes one of the first tech giants to market with real-time AI video on smart glasses. Google recently said it plans to sell AR glasses with similar capabilities, but the company hasn’t committed to a concrete timeline. Meta claims that, in the future, live AI will even give “useful suggestions” before a wearer asks. What sort of suggestions? The company wouldn’t say. Firmware v11 also introduces live translation, which enables Ray-Ban Meta wearers to translate real-time speech between English and Spanish, French, or Italian. When a wearer is talking to someone speaking one of those languages, they’ll hear what the speaker says in English through the glasses’ open-ear speakers and get a transcript on their paired phone. Ray-Ban Meta also has Shazam support as of firmware v11. Wearers can say “Hey Meta, Shazam this song” to have the glasses try to find the tune that’s playing. Meta warns that the new feature, in particular live AI and live translation, might not always get things right. “We’re continuing to learn what works best and improving the experience for everyone,” the company wrote in a blog post . Ray-Ban Meta last got a major update in November , when Meta begun to roll out certain AI capabilities to users of the glasses in France, Italy, and Spain. The glasses continue to sell quite well; in October, Ray-Ban owner EssilorLuxottica told Upload VR that Ray-Ban Meta was the top-selling glasses brand in 60% of all Ray-Ban stores across Europe, the Middle East, and Africa.",
    "summary": "Meta released firmware v11 for its Ray-Ban Meta smart glasses, adding \"live AI.\"  This feature enables real-time conversations with Meta AI,  real-time video analysis (identifying objects in the wearer's view), and live translation between English, Spanish, French, and Italian.  The update also includes Shazam song recognition.  While Meta acknowledges potential inaccuracies, this marks one of the first commercially available implementations of real-time AI video on smart glasses.\n",
    "image": "https://techcrunch.com/wp-content/uploads/2024/09/Ray-Ban-Meta-Lifestyle11.png?resize=1200,1200",
    "favicon": "https://techcrunch.com/wp-content/uploads/2015/02/cropped-cropped-favicon-gradient.png?w=32"
  },
  {
    "score": 0.17110303044319153,
    "title": "Google DeepMind on X: \"Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥\n\nWe’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4\" / X",
    "id": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "2024-12-16 None Conversation read image description read image description 5:03 PM · Dec 16, 2024",
    "summary": "Google DeepMind announced two AI updates today: Veo 2, a state-of-the-art video generation model creating realistic clips from text or image prompts; and an improved version of their text-to-image model, Imagen 3, accessible via ImageFX.\n"
  },
  {
    "score": 0.17079319059848785,
    "title": "SearchGPT Rolling Out to All OpenAI Users Starting Today",
    "id": "https://www.macrumors.com/2024/12/16/searchgpt-available-to-all-users/",
    "url": "https://www.macrumors.com/2024/12/16/searchgpt-available-to-all-users/",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "Monday December 16, 2024 3:24 pm PST by Juli Clover",
    "text": "The dedicated ChatGPT search engine that OpenAI developed is rolling out to all users starting today, OpenAI announced as part of its 12 days of OpenAI event. SearchGPT was added to ChatGPT in late October, providing improved AI-based searches right from the ChatGPT app and web interface. According to OpenAI, SearchGPT is able to search the web in a \"much better way than before,\" providing links to relevant web sources along with contextual information and support for follow-up questions. When it first debuted, SearchGPT was limited to those who subscribed to ChatGPT Plus and ChatGPT Teams, but it will now also be coming to free users. During today's announcement, OpenAI said that its AI search has been improved over the last few months, making it faster and better on mobile. There's also a new option to search as you converse with ChatGPT, and to make ChatGPT Search the default engine for browsers like Chrome. OpenAI is bringing search to logged in ChatGPT users, so it will be available globally on all platforms that support ChatGPT. Popular Stories Major iPhone 17 Pro Redesign Backed by Supply Chain Info, Claims Leaker Thursday December 12, 2024 4:36 am PST by Tim Hardwick Next year's iPhone 17 Pro models will reportedly feature a major redesign, specifically centering around changes to the rear camera module, and now new supply chain information appears to confirm the striking change, according to a Chinese leaker. iPhone 17 Pro concept render Late last month, The Information's Wayne Ma claimed that the rear of the ‌iPhone 17‌ Pro and ‌iPhone 17‌ Pro... 'iPhone 17 Air' With 'Major' Design Changes and 19-Inch MacBook Detailed in New Report Sunday December 15, 2024 9:47 am PST by Joe Rossignol Apple is planning a series of \"major design\" and \"format changes\" for iPhones over the next few years, according to The Wall Street Journal's Aaron Tilley and Yang Jie. The paywalled report published today corroborated the widely-rumored \"iPhone 17 Air\" with an \"ultrathin\" design that is thinner than current iPhone models. The report did not mention a specific measurement, but previous... New Apple TV and HomePod Mini Launching in 2025 Thursday December 12, 2024 10:39 am PST by Juli Clover Apple plans to refresh both the Apple TV and the HomePod mini in 2025 as part of a major push into refreshing its smart home product offerings, reports Bloomberg's Mark Gurman. In a report on an upcoming Apple-designed Bluetooth and Wi-Fi chip, Gurman says that the chip will be introduced in a new Apple TV and HomePod mini that are \"scheduled\" for 2025. While there is no exact timeline... Cloud-Based M4 and M4 Pro Mac Mini Models Now Available Developers now have access to cloud-based M4 and M4 Pro Mac mini units via MacWeb, a Silicon Valley-based provider of cloud services. The company has launched three configurations of the new Mac mini, powered by Apple's M4 and M4 Pro chips. Developers and IT teams can rent these machines for tasks ranging from basic development to advanced artificial intelligence modeling, providing an... iPhone 17 Air Model Enters Product Introduction Phase at Foxconn Friday December 13, 2024 2:57 am PST by Tim Hardwick Apple's rumored new iPhone 17 Air model has entered the new product introduction phase (NPI) at Foxconn, according to supply chain sources (via DigiTimes). The NPI phase transitions a product from concept to mass production, beginning with design validation and prototype testing, followed by supplier qualification and manufacturing process development. Pilot production runs test the... Apple 'Working' on Redesigned Magic Mouse With a Long-Awaited 'Fix' Sunday December 15, 2024 8:43 am PST by Joe Rossignol Apple is working on a redesigned Magic Mouse that will address some \"longstanding complaints,\" according to Bloomberg's Mark Gurman. In his Power On newsletter today, Gurman said Apple in recent months has been working on a \"full overhaul\" of the Magic Mouse with a design that \"better fits the modern era.\" However, he does not expect the new Magic Mouse to be released in the \"next 12 to 18...",
    "summary": "OpenAI announced today that its AI-powered search engine, SearchGPT, is now available to all ChatGPT users.  Previously only accessible to ChatGPT Plus and Teams subscribers, SearchGPT offers improved web searching, providing links and contextual information, and supports follow-up questions.  OpenAI claims recent improvements have made it faster and better on mobile, with a new option to search while conversing and set it as your default browser search engine.\n",
    "image": "https://images.macrumors.com/t/P00noAJWTMQQ1yMNBoXZztmW4DQ=/3840x/article-new/2024/10/chatgpt-search-engine.jpg",
    "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png"
  },
  {
    "score": 0.1653589904308319,
    "title": "",
    "id": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T17:03:57.000Z",
    "author": "GoogleDeepMind",
    "text": "Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥 We’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4| created_at: Mon Dec 16 17:03:57 +0000 2024 | favorite_count: 3466 | quote_count: 279 | reply_count: 135 | retweet_count: 688 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "Google DeepMind announced two AI model updates: Veo 2, a state-of-the-art video generation model creating realistic clips from text or images; and an improved Imagen 3 text-to-image model, accessible via ImageFX.\n"
  },
  {
    "score": 0.18514835834503174,
    "title": "",
    "id": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T17:03:57.000Z",
    "author": "GoogleDeepMind",
    "text": "Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥 We’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4| created_at: Mon Dec 16 17:03:57 +0000 2024 | favorite_count: 3466 | quote_count: 279 | reply_count: 135 | retweet_count: 688 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "Google DeepMind announced Veo 2, a state-of-the-art video generation model creating realistic clips from text or image prompts, and an improved Imagen 3 text-to-image model, accessible via ImageFX.\n"
  },
  {
    "score": 0.17912733554840088,
    "title": "",
    "id": "https://twitter.com/Google/status/1868706778877247658",
    "url": "https://twitter.com/Google/status/1868706778877247658",
    "publishedDate": "2024-12-16T17:16:29.000Z",
    "author": "Google",
    "text": "📣 Today we’re making updates to our video and image generation models, with Veo 2 and Imagen 3, plus our newest experiment in gen AI, Whisk. Learn more → https://t.co/M7HvzHgOfD https://t.co/hpINB9PAR4| created_at: Mon Dec 16 17:16:29 +0000 2024 | favorite_count: 285 | quote_count: 15 | reply_count: 27 | retweet_count: 32 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "Google announced updates to its video and image generation models, Veo 2 and Imagen 3, along with a new experimental AI, Whisk.  More information is available at the provided link.\n"
  },
  {
    "score": 0.17806369066238403,
    "title": "",
    "id": "https://twitter.com/OpenAI/status/1868715324885156177",
    "url": "https://twitter.com/OpenAI/status/1868715324885156177",
    "publishedDate": "2024-12-16T17:50:27.000Z",
    "author": "OpenAI",
    "text": "Day 8: ChatGPT Search Day https://t.co/mpGI9mMqtn| created_at: Mon Dec 16 17:50:27 +0000 2024 | favorite_count: 1061 | quote_count: 78 | reply_count: 218 | retweet_count: 109 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "OpenAI tweeted about \"ChatGPT Search Day\" on December 16th, 2024.  While the tweet doesn't detail specific updates, it highlights a dedicated day focused on ChatGPT search.  Further details would require visiting the linked (now unavailable) URL.\n"
  },
  {
    "score": 0.1692693829536438,
    "title": "Google DeepMind on X: \"Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥\n\nWe’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4\" / X",
    "id": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "2024-12-16 None Conversation read image description read image description 5:03 PM · Dec 16, 2024",
    "summary": "Google DeepMind announced two AI updates today: Veo 2, a state-of-the-art video generation model creating realistic clips from text or image prompts, and an improved version of their text-to-image model, Imagen 3, accessible through ImageFX.\n"
  },
  {
    "score": 0.167673259973526,
    "title": "Kirk Borne on X: \"Did you know that you can use #AI to create AI Agents? It's so true, so meta, and so achievable right now with @AbacusAI ChatLLM Teams!\n🚀🌟\nStart FREE TRIAL at https://t.co/73VwIlbcQ3 …all state-of-the-art #LLMs in one place for only $10/month (cheaper than separate purchases) https://t.co/Vfvln6pCJV\" / X",
    "id": "https://x.com/KirkDBorne/status/1868755478735446089",
    "url": "https://x.com/KirkDBorne/status/1868755478735446089",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "2024-12-16 None Conversation chatllm.abacus.ai/?token=kirk 8:30 PM · Dec 16, 2024",
    "summary": "This X post from Kirk Borne advertises AbacusAI ChatLLM Teams, a platform offering access to various state-of-the-art LLMs for $10/month.  The post highlights the ability to use AI to create AI agents.  There is no mention of specific AI updates released *today*.\n"
  },
  {
    "score": 0.1662883460521698,
    "title": "AI Impacts on X: \"New report, reanalyzing key results from the 2023 Expert Survey on Progress in AI. With in-depth discussion of methodology, excellent new charts, and open-sourced codebase, all thanks to @tmkadamcz! https://t.co/pekwwENwZq\" / X",
    "id": "https://x.com/AIImpacts/status/1868737719750607077",
    "url": "https://x.com/AIImpacts/status/1868737719750607077",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "Conversation 7:19 PM · Dec 16, 2024",
    "summary": "This X post announces a new report reanalyzing results from the 2023 Expert Survey on Progress in AI.  The report includes updated methodology, charts, and an open-sourced codebase.  While the post itself doesn't contain the report's content, it points to a resource where the details can be found.\n"
  },
  {
    "score": 0.1906580924987793,
    "title": "Google DeepMind on X: \"Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥\n\nWe’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4\" / X",
    "id": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://x.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "2024-12-16 None Conversation read image description read image description 5:03 PM · Dec 16, 2024",
    "summary": "Google DeepMind announced two AI model updates today: Veo 2, a state-of-the-art video generation model creating realistic clips from text or image prompts, and an improved version of their text-to-image model, Imagen 3, accessible via ImageFX.\n"
  },
  {
    "score": 0.19010549783706665,
    "title": "",
    "id": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "url": "https://twitter.com/GoogleDeepMind/status/1868703624714395907",
    "publishedDate": "2024-12-16T17:03:57.000Z",
    "author": "GoogleDeepMind",
    "text": "Today, we’re announcing Veo 2: our state-of-the-art video generation model which produces realistic, high-quality clips from text or image prompts. 🎥 We’re also releasing an improved version of our text-to-image model, Imagen 3 - available to use in ImageFX through https://t.co/h6ejHaMUM4| created_at: Mon Dec 16 17:03:57 +0000 2024 | favorite_count: 3466 | quote_count: 279 | reply_count: 135 | retweet_count: 688 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "Google DeepMind announced two AI updates today: Veo 2, a state-of-the-art video generation model producing realistic clips from text or image prompts; and an improved version of Imagen 3, their text-to-image model, accessible via ImageFX.\n"
  },
  {
    "score": 0.1826091855764389,
    "title": "AI Impacts on X: \"New report, reanalyzing key results from the 2023 Expert Survey on Progress in AI. With in-depth discussion of methodology, excellent new charts, and open-sourced codebase, all thanks to @tmkadamcz! https://t.co/pekwwENwZq\" / X",
    "id": "https://x.com/AIImpacts/status/1868737719750607077",
    "url": "https://x.com/AIImpacts/status/1868737719750607077",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "",
    "text": "Conversation 7:19 PM · Dec 16, 2024",
    "summary": "This X post announces a new report reanalyzing results from a 2023 Expert Survey on AI Progress.  The report includes updated methodology, charts, and open-sourced code.  While the post itself doesn't contain the report's content, it points to a link (which is likely broken or incomplete in the provided text).  Therefore, there are no specific AI updates detailed in the post itself.\n"
  },
  {
    "score": 0.18001475930213928,
    "title": "",
    "id": "https://twitter.com/Google/status/1868706778877247658",
    "url": "https://twitter.com/Google/status/1868706778877247658",
    "publishedDate": "2024-12-16T17:16:29.000Z",
    "author": "Google",
    "text": "📣 Today we’re making updates to our video and image generation models, with Veo 2 and Imagen 3, plus our newest experiment in gen AI, Whisk. Learn more → https://t.co/M7HvzHgOfD https://t.co/hpINB9PAR4| created_at: Mon Dec 16 17:16:29 +0000 2024 | favorite_count: 285 | quote_count: 15 | reply_count: 27 | retweet_count: 32 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "Google announced updates to its video and image generation models, Veo 2 and Imagen 3, and a new experimental AI, Whisk.  More information is available at the provided link.\n"
  },
  {
    "score": 0.1787230372428894,
    "title": "Luigi Mangione fake news could have been easily avoided by Apple Intelligence",
    "id": "https://9to5mac.com/2024/12/16/luigi-mangione-fake-news-could-have-been-easily-avoided-by-apple-intelligence/",
    "url": "https://9to5mac.com/2024/12/16/luigi-mangione-fake-news-could-have-been-easily-avoided-by-apple-intelligence/",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "Ben Lovejoy",
    "text": "Apple Intelligence managed to create a piece of Luigi Mangione fake news last week, thanks to the notification summary feature. It somehow decided that the suspect in the killing of United Health CEO Brian Thompson had shot himself. The mistake, in itself, is not surprising: AI systems make this kind of error all the time. What is rather more surprising is that Apple allowed it to happen when it could have been easily avoided … AI mistakes can be amusing or dangerous Today’s generative AI systems can often deliver impressive results, but they of course aren’t actually intelligent – and that has seen them making some pretty spectacular mistakes. Many of these are amusing. There was the McDonalds drive-through AI system which kept adding chicken nuggets to customer orders until it hit a total of 260; Google reporting a geologist recommendation to eat one rock per day , and suggesting that we use glue to help cheese stick to pizza; and Microsoft recommending a food bank as a tourist destination. But there have been examples of dangerous AI advice. There was an AI-written book on mushroom foraging which recommended tasting mushrooms as a way to identify poisonous ones ; mapping apps that directed people into wildfires ; and the Boeing system which caused two airliners to crash , killing 346 people. Or they can be simply embarrassing The Apple Intelligence summary of a BBC News story was neither amusing nor dangerous, but was embarrassing. Apple Intelligence, launched in the UK earlier this week, external, uses artificial intelligence (AI) to summarise and group together notifications. This week, the AI-powered summary falsely made it appear BBC News had published an article claiming Luigi Mangione, the man arrested following the murder of healthcare insurance CEO Brian Thompson in New York, had shot himself. He has not. It wasn’t the first time we’ve seen this – a previous Apple Intelligence notification summary claimed that Israeli prime minister Benjamin Netanyahu had been arrested , when the actual story was the ICC issuing a warrant for his arrest. Mangione fake news was avoidable It’s impossible to avoid all these errors; it’s simply in the nature of generative AI systems to make them. This is all the more true in the case of Apple’s notifications summary of news headlines. Headlines are, by their very nature, very partial summaries of a story. Apple Intelligence is attempting to further condense a highly-condensed version of a news story; a very brief summary of a very brief summary. It’s not at all surprising that this sometimes goes badly wrong. While Apple can’t prevent this in general, it could at least prevent it happening on particularly sensitive stories. It could trap keywords like killing, killed, shooter, shooting, death, and so on, and flag those for human review before they are used. In this particular case, the error was simply embarrassing, but it’s not at all hard to see how a mistake on a sensitive topic like this could lead to making a lot of people very angry. Imagine a summary which appears to blame the victims of a violent crime or disaster, for example. Of course, human review would be an additional task for the Apple News team, but Apple could get 24/7 dedicated checking for the cost of half a dozen employees working shifts. That seems a rather small expense on Apple’s part to prevent what could be a major PR disaster for the still-fledgling feature. Photo by Jorge Franganillo on Unsplash Add 9to5Mac to your Google News feed. FTC: We use income earning auto affiliate links. More.",
    "summary": "This article discusses an error in Apple's new AI-powered notification summarizer, Apple Intelligence.  The AI incorrectly reported that Luigi Mangione, a suspect in a murder case, had shot himself, based on a news headline.  While AI errors are common, the article argues this specific mistake was avoidable and suggests Apple could implement keyword filters to flag sensitive stories for human review before summarization.  The article does not contain any information on the latest AI updates released today.\n",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2024/12/Luigi-Mangione-fake-news-could-have-been-easily-avoided-by-Apple-Intelligence.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "favicon": "https://9to5mac.com/wp-content/uploads/sites/6/2019/10/cropped-cropped-mac1-1.png?w=32"
  },
  {
    "score": 0.17660847306251526,
    "title": "SearchGPT Rolling Out to All OpenAI Users Starting Today",
    "id": "https://www.macrumors.com/2024/12/16/searchgpt-available-to-all-users/",
    "url": "https://www.macrumors.com/2024/12/16/searchgpt-available-to-all-users/",
    "publishedDate": "2024-12-16T00:00:00.000Z",
    "author": "Monday December 16, 2024 3:24 pm PST by Juli Clover",
    "text": "The dedicated ChatGPT search engine that OpenAI developed is rolling out to all users starting today, OpenAI announced as part of its 12 days of OpenAI event. SearchGPT was added to ChatGPT in late October, providing improved AI-based searches right from the ChatGPT app and web interface. According to OpenAI, SearchGPT is able to search the web in a \"much better way than before,\" providing links to relevant web sources along with contextual information and support for follow-up questions. When it first debuted, SearchGPT was limited to those who subscribed to ChatGPT Plus and ChatGPT Teams, but it will now also be coming to free users. During today's announcement, OpenAI said that its AI search has been improved over the last few months, making it faster and better on mobile. There's also a new option to search as you converse with ChatGPT, and to make ChatGPT Search the default engine for browsers like Chrome. OpenAI is bringing search to logged in ChatGPT users, so it will be available globally on all platforms that support ChatGPT. Popular Stories Major iPhone 17 Pro Redesign Backed by Supply Chain Info, Claims Leaker Thursday December 12, 2024 4:36 am PST by Tim Hardwick Next year's iPhone 17 Pro models will reportedly feature a major redesign, specifically centering around changes to the rear camera module, and now new supply chain information appears to confirm the striking change, according to a Chinese leaker. iPhone 17 Pro concept render Late last month, The Information's Wayne Ma claimed that the rear of the ‌iPhone 17‌ Pro and ‌iPhone 17‌ Pro... 'iPhone 17 Air' With 'Major' Design Changes and 19-Inch MacBook Detailed in New Report Sunday December 15, 2024 9:47 am PST by Joe Rossignol Apple is planning a series of \"major design\" and \"format changes\" for iPhones over the next few years, according to The Wall Street Journal's Aaron Tilley and Yang Jie. The paywalled report published today corroborated the widely-rumored \"iPhone 17 Air\" with an \"ultrathin\" design that is thinner than current iPhone models. The report did not mention a specific measurement, but previous... New Apple TV and HomePod Mini Launching in 2025 Thursday December 12, 2024 10:39 am PST by Juli Clover Apple plans to refresh both the Apple TV and the HomePod mini in 2025 as part of a major push into refreshing its smart home product offerings, reports Bloomberg's Mark Gurman. In a report on an upcoming Apple-designed Bluetooth and Wi-Fi chip, Gurman says that the chip will be introduced in a new Apple TV and HomePod mini that are \"scheduled\" for 2025. While there is no exact timeline... Cloud-Based M4 and M4 Pro Mac Mini Models Now Available Developers now have access to cloud-based M4 and M4 Pro Mac mini units via MacWeb, a Silicon Valley-based provider of cloud services. The company has launched three configurations of the new Mac mini, powered by Apple's M4 and M4 Pro chips. Developers and IT teams can rent these machines for tasks ranging from basic development to advanced artificial intelligence modeling, providing an... iPhone 17 Air Model Enters Product Introduction Phase at Foxconn Friday December 13, 2024 2:57 am PST by Tim Hardwick Apple's rumored new iPhone 17 Air model has entered the new product introduction phase (NPI) at Foxconn, according to supply chain sources (via DigiTimes). The NPI phase transitions a product from concept to mass production, beginning with design validation and prototype testing, followed by supplier qualification and manufacturing process development. Pilot production runs test the... Apple 'Working' on Redesigned Magic Mouse With a Long-Awaited 'Fix' Sunday December 15, 2024 8:43 am PST by Joe Rossignol Apple is working on a redesigned Magic Mouse that will address some \"longstanding complaints,\" according to Bloomberg's Mark Gurman. In his Power On newsletter today, Gurman said Apple in recent months has been working on a \"full overhaul\" of the Magic Mouse with a design that \"better fits the modern era.\" However, he does not expect the new Magic Mouse to be released in the \"next 12 to 18...",
    "summary": "OpenAI's SearchGPT, an AI-powered search engine integrated into ChatGPT, is now available to all users.  Initially a ChatGPT Plus and Teams feature, the improved search—faster, better on mobile, and with options for integrated searching during conversations and default browser search—is now available globally on all ChatGPT platforms.\n",
    "image": "https://images.macrumors.com/t/P00noAJWTMQQ1yMNBoXZztmW4DQ=/3840x/article-new/2024/10/chatgpt-search-engine.jpg",
    "favicon": "https://images.macrumors.com/images-new/favicon-32x32.png"
  }
]