[
  {
    "score": 0.1599183827638626,
    "title": "Bojan Tunguz on X: \"Great progress by the @xai models. According to the just released metrics by @micro1_ai, those models slightly edge out the @OpenAI models in the relevant categories. https://t.co/a4QqAKlxFj\" / X",
    "id": "https://x.com/tunguz/status/1868266061583520190",
    "url": "https://x.com/tunguz/status/1868266061583520190",
    "publishedDate": "2024-12-15T00:00:00.000Z",
    "author": "",
    "text": "Conversation 12:05 PM 路 Dec 15, 2024 By signing up, you agree to the and , including",
    "summary": "Bojan Tunguz tweeted that new metrics from micro1_ai show XAI models slightly outperform OpenAI models in relevant categories.  This is the latest AI update he mentions.\n"
  },
  {
    "score": 0.14286398887634277,
    "title": "AGI.Eth on X: \"AI Agents are the new NFTs \n\nWe Are LEGION 攫攫攫攫攫攫攫\n\nDiscord: https://t.co/EJ3dQa5630\n\n$AGI #AIAgent #AIDAO #NFT https://t.co/zxnhfoPAts\" / X",
    "id": "https://x.com/ceobillionaire/status/1868092055333007402",
    "url": "https://x.com/ceobillionaire/status/1868092055333007402",
    "publishedDate": "2024-12-15T00:00:00.000Z",
    "author": "",
    "text": "Discord: https://t.co/EJ3dQa5630 $AGI #AIAgent #AIDAO #NFT https://t.co/zxnhfoPAts\" / X 2024-12-15 None Conversation discord.gg/montrealai 12:33 AM 路 Dec 15, 2024 By signing up, you agree to the and , including",
    "summary": "This X post from December 15, 2024, by @ceobillionaire claims that \"AI Agents are the new NFTs,\" promoting a Discord server (link provided) related to $AGI, #AIAgent, #AIDAO, and #NFT.  The post itself doesn't contain any details about specific AI updates released that day.\n"
  },
  {
    "score": 0.178040012717247,
    "title": "Bojan Tunguz on X: \"Great progress by the @xai models. According to the just released metrics by @micro1_ai, those models slightly edge out the @OpenAI models in the relevant categories. https://t.co/a4QqAKlxFj\" / X",
    "id": "https://x.com/tunguz/status/1868266061583520190",
    "url": "https://x.com/tunguz/status/1868266061583520190",
    "publishedDate": "2024-12-15T00:00:00.000Z",
    "author": "",
    "text": "Conversation 12:05 PM 路 Dec 15, 2024 By signing up, you agree to the and , including",
    "summary": "Bojan Tunguz's X post reports that new metrics from micro1.ai show XAI models slightly outperforming OpenAI models in relevant categories.  This is the latest AI update mentioned in the provided text.\n"
  },
  {
    "score": 0.1669478863477707,
    "title": "",
    "id": "https://twitter.com/SpirosMargaris/status/1868201580064825373",
    "url": "https://twitter.com/SpirosMargaris/status/1868201580064825373",
    "publishedDate": "2024-12-15T07:49:00.000Z",
    "author": "SpirosMargaris",
    "text": "OpenAI launches canvas, Cohere's compact model, and more fundraising: This week's AI launches https://t.co/1tFL7oh8no @britneycath @qz| created_at: Sun Dec 15 07:49:00 +0000 2024 | favorite_count: 7 | quote_count: 0 | reply_count: 0 | retweet_count: 3 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "OpenAI released Canvas, and Cohere launched a compact model, according to a recent tweet.  These are among the latest AI updates noted.\n"
  },
  {
    "score": 0.1661902517080307,
    "title": "AGI.Eth on X: \"AI Agents are the new NFTs \n\nWe Are LEGION 攫攫攫攫攫攫攫\n\nDiscord: https://t.co/EJ3dQa5630\n\n$AGI #AIAgent #AIDAO #NFT https://t.co/zxnhfoPAts\" / X",
    "id": "https://x.com/ceobillionaire/status/1868092055333007402",
    "url": "https://x.com/ceobillionaire/status/1868092055333007402",
    "publishedDate": "2024-12-15T00:00:00.000Z",
    "author": "",
    "text": "Discord: https://t.co/EJ3dQa5630 $AGI #AIAgent #AIDAO #NFT https://t.co/zxnhfoPAts\" / X 2024-12-15 None Conversation discord.gg/montrealai 12:33 AM 路 Dec 15, 2024 By signing up, you agree to the and , including",
    "summary": "This X post from @ceobillionaire declares that \"AI Agents are the new NFTs,\" promoting a Discord server (link provided) related to $AGI, #AIAgent, #AIDAO, and #NFT.  The post does not contain any information about specific AI updates released today.\n"
  },
  {
    "score": 0.1925136148929596,
    "title": "Random Thoughts on AI (Human Generated)",
    "id": "https://blog.computationalcomplexity.org/2024/12/random-thoughts-on-ai-human-generated.html",
    "url": "https://blog.computationalcomplexity.org/2024/12/random-thoughts-on-ai-human-generated.html",
    "publishedDate": "2024-12-15T13:50:00.000Z",
    "author": "",
    "text": "(I wrote this post without any AI help. OH- maybe not- I used spellcheck. Does that count? Lance claims he proofread it and found some typos to correct without any AI help.) Random Thought on AI I saw a great talk on AI recently by Bill Regli, who works in the field. Announcement of the talk: here Video of the talk: here ----------------------------------------------- 1) One item Bill R mentioned ws that AI requires lots of Energy so 3-mile Island is being reopened. See here . Later I recalled the song The Girl from 3-Mile Island to the tune of The Girl from Ipanema. The song is in my audio tape collection but that is not useful so I looked for it on the web. The copy on YouTube doesn't work; however, this website of songs about 3-mile island here included it. In the 1990's I was in charge of the Dept Holiday Entertainment since I have an immense knowledge of, and collection of, novelty songs- many in CS and Math. Today- My talents are no longer needed as anyone can Google Search and find stuff. I did a blog on that here. I still have SOME advantage since I know what's out there, but not as much. Indeed, AI can even write and sing songs. I blogged about that and pointed to one such song here . SO, some people's talents and knowledge are becoming obsolete. On the level of novelty songs I am actually HAPPY that things change- I can access so much stuff I could not before. But humans becoming obsolete is a serious issue of employment and self worth. Far more serious then MACHINES TAKE OVER THE WORLD scenarios. --------------------------------------------------------- 2) When technology made farming jobs go away, manufacturing jobs took their place. That was true in the LONG run, but in the SHORT run there were starving ex-farmers. The same may happen now. Truck Drivers and Nurses may do better than Accountants and Lawyers: Self Driving trucks are 10 years away and always will be. Nurses need to have a bedside manner that AI doesn't (for now?). One ADVANTAGE of AI is that if it makes white collar workers lose jobs the government might get serious about Guaranteed Basic Income, and Univ. Health care Similar: If global warming makes the Cayman Island sink then suddenly Global Warming will be an important problem to solve. ------------------------------------------------ 3) An example of AI taking away jobs is the Writers Strike. OLD WAY: There were 10 people writing Murder She Wrote Scripts. NEW WAY: AN AI generates a first draft and only needs 2 people to polish it. KEY: In a murder mystery the guilty person is an innocuous character you saw in the first 10 minutes or a celebrity guest star. Sometimes the innocuous character is the celebrity guest star. ------------------------------------------------- 4) ChatGPT and school and cheating. Calculator Scenario : We will allow students to use Chat GPT as we now allow calculators. Students are not as good at arithmetic, but we don't care. Is Chat GPT similar? Losing battle scenario: Ban Chat GPT My solution which works--- for now: Ask questions that Chat GPT is not good at, allow chat GPT, insist the students understand their own work, and admit they used it. Works well in Grad courses and even senior courses. Might be hard in a Freshman courses. Lance's Solution --- Stop giving out grades. See here ---------------------------------------------- 5) Bill R said that we will always need humans who are better at judgment. Maybe a computer has better judgment. I blogged on this here -------------------------------------------------- 6) I asked two AI people at lunch if the AI revolution is just because of faster computers and hence is someone limited. They both said YES. SO- could it be that we are worrying about nothing? This also may be an issue with academia: if we hire lots of AI people because it's a hot area, it may cool off soon. Actually I thought the same thing about Quantum Computing, but I was wrong there. ---------------------------------------------- 7) LMM's use LOTS of energy. If you get to ask one How do we solve global warming? they might say First step: Turn me off! ---------------------------------------------- 8) Scott did a great blog post about the ways AI could go. See here . -------------------------------- 9) I recently emailed Lance a math question. He emailed me the answer 5 minutes later. I emailed that I was impressed He emailed that he just asked for Chat GPT. He had not meant to fool me, he just assumed I would assume that. Like if you asked me what 13498*11991 was and I answered quickly you would assume I used a calculator. And if there is a complicated word in this post that is spelled correctly then you would assume I used spellcheck - and there is no embarrassment in that. -------------------------------- 10) If a painting is done with AI does any human get credit for it? I always thought that people who forge paintings that look JUST LIKE (say) a van Gogh should be able to be honest about what they do and get good money since it LOOKS like a van Gogh who cares that it is NOT a van Gogh. Same with AI- we should not care that a human was not involved. IF an AI finds a cure for cancer, Great! If an AI can write a TV series better than the human writers, Great! -------------------------------------------------------- 11) AI will force us to make moral choices. Here is a horrifying scenario: Alice buys a self-driving car and is given some options, essentially the trolley problem: If your car has to choose who to run over, what do you choose? You have the option of picking by race, gender, age, who is better dressed, anything you want. ------------------------------------------------------- 12) Climate Change has become a political problem in that Democrats think it IS a problem Rep think it is NOT a problem Which is a shame since free-market solutions that would normally appeal to Reps are not being done (e.g., a Carbon Tax). Indeed, we are doing the opposite- some states impose a tax on Hybrid cars. SO- how will AI go with politics? Scenarios a) Dems are for regulation, Reps are against it. Elon Musk worries about AI and he is a powerful Rep so this might not happen. Then again, he supports Reps, many of whom have BANNED E-cars in their states b) AI-doomsayers want more regulation, AI-awesomers do not, and this cuts across party lines. c) We will ignore the issue until it's too late. If I was a betting man ... ---------------------------------------------------------- 13) International cooperation on being careful with AI. Good luck with that. My cynical view: International Treaties only work when there is nothing at stake The Chem Weapons ban works because they are hard to use anyway. The treaty on exploring Antarctica was working until people found stuff there they wanted. It is now falling apart",
    "summary": "This blog post does not contain information on the latest AI updates released today.  It discusses the author's reflections on AI's impact, including its energy consumption (mentioning the reopening of Three Mile Island due to increased energy demands), its potential to displace human workers (using the example of the writer's strike), and its implications for education (comparing the use of ChatGPT to calculators in schools).  There is no mention of specific, recently released AI updates.\n",
    "favicon": "https://blog.computationalcomplexity.org/favicon.ico"
  },
  {
    "score": 0.17594954371452332,
    "title": "Bojan Tunguz on X: \"Great progress by the @xai models. According to the just released metrics by @micro1_ai, those models slightly edge out the @OpenAI models in the relevant categories. https://t.co/a4QqAKlxFj\" / X",
    "id": "https://x.com/tunguz/status/1868266061583520190",
    "url": "https://x.com/tunguz/status/1868266061583520190",
    "publishedDate": "2024-12-15T00:00:00.000Z",
    "author": "",
    "text": "Conversation 12:05 PM 路 Dec 15, 2024 By signing up, you agree to the and , including",
    "summary": "Bojan Tunguz tweeted that new metrics from Micro1 AI show their XAI models slightly outperform OpenAI models in relevant categories.  This is the latest AI update mentioned in the provided text.\n"
  },
  {
    "score": 0.17377158999443054,
    "title": "",
    "id": "https://twitter.com/SpirosMargaris/status/1868201580064825373",
    "url": "https://twitter.com/SpirosMargaris/status/1868201580064825373",
    "publishedDate": "2024-12-15T07:49:00.000Z",
    "author": "SpirosMargaris",
    "text": "OpenAI launches canvas, Cohere's compact model, and more fundraising: This week's AI launches https://t.co/1tFL7oh8no @britneycath @qz| created_at: Sun Dec 15 07:49:00 +0000 2024 | favorite_count: 7 | quote_count: 0 | reply_count: 0 | retweet_count: 3 | is_quote_status: False | retweeted: False | lang: en",
    "summary": "OpenAI released Canvas, and Cohere launched a compact model.  This is according to a tweet from @SpirosMargaris summarizing recent AI launches.\n"
  }
]