"Here are the filtered and categorized articles based on your criteria:\n\n### Useful for Developers\n1. **Google’s Whisk AI generator** \n   - Category: Developer-related\n   - Summary: Google released Whisk, an image generation tool using images as prompts instead of text, powered by Imagen 3. It's designed for rapid visual exploration, allowing users to remix existing images to create new ones.\n   - Available: Yes\n\n2. **SearchGPT Rolling Out to All OpenAI Users Starting Today**\n   - Category: Developer-related\n   - Summary: OpenAI has released SearchGPT to all ChatGPT users, offering improved AI-powered searches with faster, mobile-optimized functionalities and real-time web search integration.\n   - Available: Yes\n\n3. **Microsoft Announces Phi-4 AI Model**\n   - Category: Developer-related\n   - Summary: Microsoft announced Phi-4, a 14-billion parameter AI model designed for complex reasoning tasks, available on Azure AI Foundry.\n   - Available: Yes\n\n4. **Whisk: Visualize and remix ideas using images and AI**\n   - Category: Developer-related\n   - Summary: Google Labs released Whisk, a generative AI tool for creating images using other images. It uses Gemini and Imagen 3 models.\n   - Available: Yes\n\n### Relevant for Business Owners or Work Professionals\n1. **Meta updates its smart glasses with real-time AI video**\n   - Category: Consumer-related\n   - Summary: Meta's Ray-Ban Meta smart glasses received an update with real-time AI video capabilities and live translation, enhancing user interactivity.\n   - Available: Yes\n\n2. **HEALWELL to Acquire Orion Health**\n   - Category: Business-related\n   - Summary: HEALWELL AI's acquisition of Orion Health enhances its healthcare data interoperability and AI capabilities, expanding its global reach.\n   - Available: Yes\n\n3. **ChatGPT Search is now available to everyone for free**\n   - Category: Business-related\n   - Summary: OpenAI has made ChatGPT Search available to all users, integrating real-time web search capabilities directly into ChatGPT.\n   - Available: Yes\n\n### Categorized as Developer-Related vs Consumer-Related\n- **Developer-Related:**\n  - Google’s Whisk AI generator\n  - SearchGPT Rolling Out to All OpenAI Users Starting Today\n  - Microsoft Announces Phi-4 AI Model\n  - Whisk: Visualize and remix ideas using images and AI\n\n- **Consumer-Related:**\n  - Meta updates its smart glasses with real-time AI video\n\nThese articles were selected based on their relevance to developers and business professionals, their availability for use, and the exclusion of repeated updates."